**** Hy : 선형여부 확인
#+BEGIN_SRC hy :session :results output
(import sympy)
(import [sympy [Eq]]
        [sympy.abc [x y z]]
        [sympy.core.sympify [kernS]]
        [sympy.parsing.sympy_parser [*]]
;;        [infix [*]]
        [PlumpMath [is_linear]])
;;(require infix)

(setv st (+ standard_transformations (, implicit_multiplication)))
(setv A (Eq (parse_expr :s "4x-5y+2" :transformations st) x))
(setv B (Eq y (kernS "2*(sqrt(6)-x)+z")))

(print "A:linearity " (is_linear A [x y z]))
(print "B:linearity " (is_linear B [x y z]))
#+END_SRC

#+RESULTS:
: A:linearity  True
: B:linearity  True

**** Hy : 선형여부 확인
#+BEGIN_SRC hy :session :results output
(import sympy)
(import [sympy [Eq]]) 
(import [sympy.abc [x y z]])
(import [sympy.core.sympify [kernS]])
(import [sympy.parsing.sympy_parser [*]])
(import [PlumpMath [is_linear]])
;;(setv eq1 (Eq (- (* 4  x) (* 5  y))  (*  x  y))) ;;s-exp표기법 표현이 (form)배기싫다.
;;(setv eq1 (Eq (kernS "4*x-5*y") (kernS "x*y"))) ;;곱하기도 빼버리고 싶다.
(setv st (+ standard_transformations (, implicit_multiplication)))
(setv eq1 (Eq (parse_expr :s "4x-5y" :transformations st)  (kernS "x*y")))
(setv eq2 (Eq (kernS "2*sqrt(x)-6") (kernS "y")))  ;;(setv eq2 (Eq (- (* 2 (sympy.sqrt x)) 6)  y))
(print "eq1:linearity " (is_linear eq1 [x y]))
(print "eq2:linearity " (is_linear eq2 [x y]))
#+END_SRC

#+RESULTS:
: eq1:linearity  False
: eq2:linearity  False

**** Hy : 해 구하기

#+BEGIN_SRC hy :session :results output
(import sympy)
(import [sympy [Eq Matrix linsolve]]) 
;;(import [sympy.solvers.solveset [linsolve]])
(import [sympy.abc [x y z]])
(setv aug (Matrix [[2 -1 1.5 8] [1 0 -4 -7]]))
(print (linsolve aug x y z))
#+END_SRC

#+RESULTS:
: {(4.0*z - 7, 9.5*z - 22, z)}

***** Hy : 해 구하기 --- 위에서 한번 언급(미지수가 남는다.)
#+BEGIN_SRC hy :session :results output
(import sympy)
(import [sympy [Eq Matrix linsolve]]) 
(import [sympy.abc [x y]])
(setv aug (Matrix [[1 -2 -1] [-1 2 1]]))
(print (linsolve aug x y))
#+END_SRC

#+RESULTS:
: {(2*y - 1, y)}

**** Hy : 해 구하기 : 해가 없넹.
#+BEGIN_SRC hy :session :results output
(import sympy)
(import [sympy [Eq Matrix linsolve]]) 
(import [sympy.abc [x y]])
(setv aug (Matrix [[1 -2 -1] [-1 2 3]]))
(print (linsolve aug x y))
#+END_SRC

#+RESULTS:
: EmptySet()

